package exer;
/*
	问题描述
	2015年，全中国实现了户户通电。作为-名电力建设者，小明正在帮助一带- -路上的国家通电。这次，小明要帮助n个村庄通电，
	其中1号村庄正好可以建立一个发电站，所发的电足够所有村庄使用。现在，这n个村庄之间都没有电线相连，小明主要要做的
	是架设电线连接这些村庄，使得所有村庄都直接或间接的与发电站相通。小明测量了所有村庄的位置(坐标)和高度，如果要连接两
	个村庄，小明需要花费两个村庄之间的坐标距离加上高度差的平方，形式化描述为坐标为(x 1,y_ 1)高度为h 1的村庄与坐标为
	(x_ 2,y_ _2) 高度为h 2的村庄之间连接的费用为sqt((x_ 1-x _2)*(x_ 1-x_ 2)+(y_ 1-y_ 2)*(y_ 1-y_ 2))+(h 1-
	h_ 2)*(h _1-h _2)。在上式中sqrt表示取括号内的平方根。请注意括号的位置，高度的计算方式与横纵坐标的计算方式不同。
	由于经费有限，请帮助小明计算他至少要花费多少费用才能使这n个村庄都通电。
	输入格式     输入的第一行包含一个整数n，表示村庄的数量。接下来n行，每个三个整数x, y, h,分别表示-一个村庄的横、纵坐标和高度，
	其中第一个村庄可以建立发电站。
	输出格式    输出一行，包含一个实数，四舍五入保留2位小数，表示答案。
	样例输入
	113
	997
	886
	454
	样例输出
	17.41
	评测用例规模与约定
	对于30%的评测用例，1<=n<=10;
	对于60%的评测用例，1 <= n <= 100;
	对于所有评测用例，1 <=n <= 1000，0<= x,y,h <=
	10000。
 */
public class Six {

}
